# GetUGridLineIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGrid..::..GetUGridLineIds Method
CurtainGrid Class See Also
---
Gets all ElementIds of grid lines in the U direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> GetUGridLineIds()
```

Visual Basic
---
```text
Public Function GetUGridLineIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetUGridLineIds()
```

# ### Return Value
The U grid line ElementIds
# See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace